[
    {
        "role":"Principal Engineer",
        "company":"HUAWEI · Paris, France",
        "summary":"My current role is at the cross-over between BigData, networks, and AI. I work in the Huawei DataCom R&D AI team focused on integrating AI in data-plane programming, distributed telemetry and other network monitoring solutions for the Huawei DataCom product line. In particular, I'm leading the research related to traffic classification with an emphasis towards continual learning (e.g., incremental learning and few-shot learning) and data augmentation (e.g., self-supervision).  I'm also responsible for the design and prototype of next-generation network probes which can take advantage of ML/DL via advanced GPU/TPU cards (e.g., Huawei Ascend 310 / 910) to compute advanced network analytics.",
        "range":"September 2019 - Present"
    },
    {
        "role":"Principal Engineer",
        "company":"Telefonica UK / O2 · London, UK",
        "summary":"Started as research experiment and later graduated to product, I was leading the design and development of BigData analytics (using Apache Spark) and ML applications (using Keras, and scikit-lear). I took advantage of a large on-premise Hadoop cluster (250+ nodes) where data collected from different network core monitoring elements were stored, to create insights about users quality of experience (QoE), that were used to model >30M customer satisfaction. I've been responsible for the design, implementation, and operation of the whole pipeline (analytics+modeling) which has been successfully used internally. In parallel, I was still part of the research community (in particular related to traffic analysis), with different collaborations with universities and other research centres.",
        "range":"January 2018 - September 2019"
    },
    {
        "role":"Research Associate",
        "company":"Telefonica Research · Barcelona, Spain",
        "summary":"I worked on research projects related to mobile network analytics spanning from traffic encryption (e.g., HTTP2 adoption and performance), to users quality of experience (e.g., mobile critical path analysis) and users behavior (e.g., users mobility). I also collaborated with different operational business within Telefonica global (e.g., O2/UK, Movistar/Peru, Movistar/Argentina) across different projects related to network analytics and bigdata (e.g., use radio tower KPIs to understand users experience).",
        "range":"December 2014 - January 2018"
    },
    {
        "role":"Visiting Scholar",
        "company":"Narus Inc · Sunnyvale, CA, U.S",
        "summary":"I worked on developing novel techniques for identifying and dissecting network traffic generated by malware executable, rootkit applications, and more general mobile/host traffic behaviors. The techniques developed lead to discovery of security issues actually exploited in the wild.  I worked on developing novel techniques for identifying and dissecting network traffic generated by malware executable, rootkit applications, and more general mobile/host traffic behaviors. The techniques developed lead to discovery of security issues actually exploited in the wild.",
        "range":"Oct 2013 - September 2014"
    },
    {
        "role":"Internship",
        "company":"Telefonica I+D · Barcelona, Spain",
        "summary":"I worked on a project to extract network analytics from a country-scale dataset by means of an Hadoop Cluster. The work lead to publication of one of the first studies related to the mobile ads ecosystem. I worked on a project to extract network analytics from a country-scale dataset by means of an Hadoop Cluster. The work lead to publication of one of the first studies related to the mobile ads ecosystem.",
        "range":"January 2012 - April 2014"
    },
    {
        "role":"Visiting PhD Student",
        "company":"Purdue University · Lafayette, Indiana, U.S.",
        "summary":"I worked on a research project related to understanding the YouTube CDN by means of data gathered from passive network probes we deployed in Italy and and Poland ISPs. We have been the first to uncover YouTube CDN dynamics and (at the time) the aggressive buffering of the YouTube player.  I worked on a research project related to understanding the YouTube CDN by means of data gathered from passive network probes we deployed in Italy and and Poland ISPs. We have been the first to uncover YouTube CDN dynamics and (at the time) the aggressive buffering of the YouTube player.",
        "range":"September 2010 - May 2011"
    }
]
